/*
Циклы (запрещено использовать массивы)
Организовать беспрерывный ввод чисел с клавиатуры, пока пользователь не введёт 0. После ввода нуля, показать на экран количество чисел, которые были введены, их общую сумму и среднее арифметическое. Подсказка: необходимо объявить переменную-счетчик, которая будет считать количество введенных чисел, и переменную, которая будет накапливать общую сумму чисел.
*/
#include <iostream>
using namespace std;

int main() {
  int x; cin >> x; 
  int n = 1, sum = 0;

  while(x != 0){
    cin >> x;
    sum += x; 
    if(x!= 0) n++;
  }

cout << n << " " << sum << " " << sum/n;
  return 0;
}
