/*
Совершенным называется число, равное сумме своих делителей.
До сих пор не нашли ответ на вопрос - конечно ли множество совершенных чисел или бесконечно, есть ли среди совершенных чисел нечетные? Леонард Эйлер доказал, что все четные совершенные числа имеют вид 2^(p-1)*Мр, где Мр - простое число Мерсенна. Но описал ли он этой формулой все совершенные числа?
Задание: найдите и напечатайте все совершенные числа в интервале 
[m, n].
Примеры: 6, 28, 496, 8128.
*/
#include<iostream> 
#include <cmath>
using namespace std; 

int sum(int n){
  int suma = 0;
  for(int i = 1; i < n; i++)
    if(n%i == 0) suma += i;
  return suma;
}

int main (){
  int n, m; cin >> n >> m;

for(int i = n; i <= m; i++){
  if(sum(i) == i && sum(i) != 0) cout << i << " ";
}
return 0;
}  
