/*
Саша совсем не любит спиннеры, поэтому он рисует в тетрадке. Он взял тетрадный
лист из N × M клеточек и пронумеровал все клетки различными числами. Ему стало
интересно, сколько различных прямоугольников он может вырезать из этого листа бумаги по
границам клеточек.
Программа получает на вход два числа N и M – размеры исходного листа. Все числа –
целые положительные, не превосходящие 75000.
Программа должна вывести одно число – количество прямоугольников, которые
можно вырезать из данного листа бумаги (весь лист целиком также считается одним из
возможных прямоугольников).
*/
#include <bits/stdc++.h>
using namespace std;

int main(){
  int n, m; cin >> n >> m;
  int ans = 0;

  for(int x1 = 0; x1 < n; x1++){
    for(int x2 = x1; x2 < n; x2++){
      for(int y1 = 0; y1 < m; y1++){
        for(int y2 = y1; y2 < m; y2++){
          ans++;
        }
      }
    }
  }
  cout << ans;
}
