/*
3. Циклы 
Организовать беспрерывный ввод чисел с клавиатуры, пока пользователь не введёт 0. После ввода нуля, показать на экран количество чисел, которые были введены, их общую сумму и среднее арифметическое. Подсказка: необходимо объявить переменную-счетчик, которая будет считать количество введенных чисел, и переменную, которая будет накапливать общую сумму чисел.
*/

#include <iostream>
#include <string>
using namespace std;

int main(){
  ios::sync_with_stdio(0); cin.tie(0);
  int x; cin >> x;
  int n = 1; float sum = 0;

  if(x!= 0){
    sum += x;
    while(x != 0){
      cin >> x;
      sum += x;
      if(x != 0) n++;
    }
    cout << sum/n;
  } else cout << "0";
  return 0;
}
