/*
Арифметические операции (запрещено использование условных конструкций и циклов)

Распространённая задача: Дано четырехзначное число (к примеру 5678), вывести на экран в обратном порядке цифры из которых это число состоит. То есть мы должны увидеть на экране 8765. Подсказка: чтобы взять из числа отдельные цифры, надо применять деление по модулю на 10.
*/
#include <iostream>
using namespace std;

void func(int x){
  if(x >= 10){cout << x%10; func((x-x%10)/10);}
  else cout << x;
    
}

int main(){
  ios::sync_with_stdio(0); cin.tie(0);
  int x; cin >> x;
  func(x);
  return 0;
}
