/*
Условный оператор (запрещено использование циклов)

Пользователь вводит порядковый номер пальца руки. Необходимо показать его название на экран.

PS Также очень рекомендую обратить внимание на задачу из презентации.
*/
#include <iostream>
using namespace std;

int main() {
  int x; cin >> x;
  string a[5] = {"мезинец", "безымянный", "средний", "указательный", "большой"};
  if(x <= 10){
    if(x == 1 || x == 10) cout << a[0];
    if(x == 2 || x == 9) cout << a[1];
    if(x == 3 || x == 8) cout << a[2];
    if(x == 4 || x == 7) cout << a[3];
    if(x == 5 || x == 6) cout << a[4];
  }
  else cout << "Error";
  return 0;
}
