/*
Числа Каталана
 Они названы в честь бельгийского математика.
Число Каталана выражается явной формулой или рекуррентной формулой  
Начало последовательности выглядит так: 1, 2, 5, 14, 42, 132, 429, 1430, 4862, 16796…
Задание: найдите и напечатайте все числа Каталана в интервале [m, n].
*/
#include <iostream> 
using namespace std; 

int f(int n){
  if(n == 0 || n == 1) return 1;
  else if(n == 2) return 2;
  else return n*f(n-1);
}

int main(){
int m, n; cin >> m >> n;
int c = 0;
while(f(2*c)/(f(c+1)*f(c)) < m) c++;
c++;
while( f(2*c)/(f(c+1)*f(c)) <= n){
    cout << f(2*c)/(f(c+1)*f(c)) << " "; 
    c++;
}

return 0;
}
