/*
Числа Армстронга
Числом Армстронга называется число, состоящее из n (n>1) цифр, если сумма его цифр, возведённых в n-ю степень, равна самому этому числу.
Например, числом Армстронга является число 153, так как 153=13+53+33
Задание: Найдите все n-значные числа Армстронга (n - входное данное, n<=10).
Пример: при n=5 это числа 54748, 92727, 93084

*/

#include <iostream> 
#include <cmath>
using namespace std; 

int sum(int i, int n, int s){
  if(i < 10){ s += pow(i, n); return s; }
  else {
    s += pow(i%10, n); return sum((i-i%10)/10, n, s);
  }
}

int main(){
int n; cin >> n;

// n = 3 100 
for(int i = pow(10, n-1); i < pow(10, n); i++){
  if(i == sum(i,n,0)) cout << i << " ";
}
return 0;
}
