/*
Простые числа Мерсенна
Числа Мерсена - числа вида Мр = 2p - 1, где p - простое число. Названы они в честь французского монаха Мерена Мерсенна - одного из основателей Парижской Академии наук. Очевидно, что для индексов p = 2, 3, 5, 7 результат получается простым, но для p = 11 получается составным: М11= 2047 = 23*89. 
Задание: найдите и напечатайте все простые числа Мерсена в интервале [m, n].

*/
#include<iostream> 
#include <cmath>
using namespace std; 

int main (){
  int n, m; cin >> n >> m;
  int p = 1;
while(pow(2, p) - 1 < n) p++;

while(pow(2, p) - 1 >= n && pow(2, p) - 1 <= m){
  cout << pow(2, p) - 1 << " "; p++;
}
return 0;
}  
