# Создайте и напечатайте (с помощью функции print) массив класса np.ndarray ширины 4 и высоты 3 с двойками на главной диагонали 
# и единицами на первой диагонали над главной, т.е. воплощение матрицы

import numpy as np

a = np.eye(3, 4, 1)
b = np.eye(3, 4, 0) * 2
print(a + b)
